---
kind: type
id: T:Autodesk.Revit.DB.FaceSecondDerivatives
source: html/6a876769-1607-4cfa-87d0-2b679e9da6e1.htm
---
# Autodesk.Revit.DB.FaceSecondDerivatives

Contains second partial derivatives of a face at a specified point.

## Syntax (C#)
```csharp
public class FaceSecondDerivatives : IDisposable
```